server/app/controllers/api/expenses_controller.rb

  def index
    render json: User.find(@user_id).expenses.all
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    expense = User.find(@user_id).expenses.create(expense_params)
---
INSERT INTO "expenses" ("title", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "jhgjhb"], ["amount", 500], ["user_id", 1], ["created_at", "2020-09-12 05:12:20.583619"], ["updated_at", "2020-09-12 05:12:20.583619"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def show
    render json: User.find(@user_id).expenses.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1 AND "expenses"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    expense = User.find(@user_id).expenses.find(params[:id])
    expense.update(expense_params)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1 AND "expenses"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "expenses" SET "title" = $1, "amount" = $2, "updated_at" = $3 WHERE "expenses"."id" = $4  [["title", "test"], ["amount", 100], ["updated_at", "2020-09-13 10:19:30.201442"], ["id", 19]]

  def destroy
    data = User.find(@user_id).expenses.destroy(params[:id])
---
DELETE FROM "expenses" WHERE "expenses"."id" = $1  [["id", 2]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1 AND "expenses"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]