server/app/controllers/api/incomes_controller.rb

  def index
    render json: User.find(@user_id).incomes.all
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = $1  [["user_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    income = User.find(@user_id).incomes.create(income_params)
---
INSERT INTO "incomes" ("title", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hjgj"], ["amount", 1000], ["user_id", 1], ["created_at", "2020-09-12 05:12:15.552278"], ["updated_at", "2020-09-12 05:12:15.552278"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def show
    render json: User.find(@user_id).incomes.find(params[:id])
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = $1 AND "incomes"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    income = User.find(@user_id).incomes.find(params[:id])
    income.update(income_params)
---
SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = $1 AND "incomes"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "incomes" SET "title" = $1, "amount" = $2, "updated_at" = $3 WHERE "incomes"."id" = $4  [["title", ""], ["amount", 60], ["updated_at", "2020-09-13 10:46:42.069789"], ["id", 35]]

  def destroy
    data = User.find(@user_id).incomes.destroy(params[:id])
---
DELETE FROM "incomes" WHERE "incomes"."id" = $1  [["id", 2]]
SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = $1 AND "incomes"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]