server/app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    user = User.find(@user_id)

INSERT INTO "users" ("name", "password_digest") VALUES ($1, $2) RETURNING "id"  [["name", "nooshin"], ["password_digest", "$2a$12$d.bN65iTrMXaP.GnLqlC2.JmJQFewcIEmHorEWyGs/QFeoja4rIU."]]
---
  def create
    user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "sara"], ["id", 2]]
---
  def update
    render json: User.find(@user_id).update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    render json: User.destroy(@user_id)